/************************************************************************
(c) 2003-04, 3DSP Corporation, all rights reserved.  Duplication or
reproduction of any part of this software (source code, object code or
comments) without the expressed written consent by 3DSP Corporation is
forbidden.  For further information please contact:
	3DSP Corporation
	16271 Laguna Canyon Rd
	Irvine, CA 92618
	www.3dsp.com
**************************************************************************/
/*
 * description:
 * 	This Header file contains the defines and structures needed for hardware access
 *
 */

#ifndef _USBWLAN_DEFS_H
#define _USBWLAN_DEFS_H

#include "usbwlan_equates.h"
#include "usbwlan_wlan.h"
#include "tdsp_basetypes.h"

#include "precomp.h"
//-------------------------------------------------------------------------
// WLAN_STA Action Commands
//-------------------------------------------------------------------------
/*
#define CB_NOP                  0
#define CB_IA_ADDRESS           1
#define CB_CONFIGURE            2
#define CB_MULTICAST            3
#define CB_TRANSMIT             4
#define CB_LOAD_MICROCODE       5
#define CB_DUMP                 6
#define CB_DIAGNOSE             7


//-------------------------------------------------------------------------
// Command Block (CB) Field Definitions
//-------------------------------------------------------------------------
//- CB Command Word
#define CB_EL_BIT               BIT_15          // CB EL Bit

#define DEFAULT_RX_FIFO_LIMIT       0x08
#define DEFAULT_UNDERRUN_RETRY      0x01
#define MINIMUM_RX_PACKET_SIZE_IN_HOST	0x1c

//Justin:	080102.		read eeprom from program which has been filled by 8051
#define LOCAL_PROGRAM_MEM_BASE               0x8000
#define POWER_TABLE_PROGRAM_OFFSET   0x0180
#define POWER_TABLE_VALID_FLAG_OFFSET   0xb4
#define POWER_TABLE_VALID_FLAG_LEN	     4

// 20081020 add by glen for support subsystemID extend defined by EEPROM data
#define EEPROM_OFFSET_SUBSYSTEMID    0x011A
/*
USB INTERFACE
Board    Build     Chip  Inter-  Rom   Chip   Eeprom      BBT      Base Eeprom
Rf       process   Rev   face    Ver   ID     SubsysID    ver      File Name
=======================================================================================
Airoha   0.18 mic  V4    USB     V3    4      0x0100      3.0.4    eeprom8_ar2230_v4_usb.in
Airoha   0.18 mic  V4    USB     V3    4      0x0200      3.2.0    eeprom8_ar2230_v4_usbMini.in

Airoha   0.15 mic  V4    USB     V4b   4      0x0500      3.1.2    eeprom8_ar2230_v4_v4brom_usb.in
Airoha   0.15 mic  V4    USB     V4b   4      0x0300      3.2.0    eeprom8_ar2230_v4_v4brom_usbMini.in
  
SST      0.18 mic  V4    USB     V4a   4      0x0400      3.1.2    eeprom8_sst_v4_usb.in
SST      0.18 mic  V4    USB     V4a   4      0x0700      3.2.0    eeprom8_sst_v4_usbMini.in

SST      0.15 mic  V4    USB     V4b   4      0x0600      3.1.2    eeprom8_sst_v4_v4brom_usb.in
SST      0.15 mic  V4    USB     V4b   4      0x0800      3.2.0    eeprom8_sst_v4_v4brom_usbMini.in
*/
#define EEPROM8_AR2230_V4_USB            0x0100 
#define EEPROM8_AR2230_V4_USBMINI        0x0200 
#define EEPROM8_AR2230_V4_V4BROM_USB     0x0500 
#define EEPROM8_AR2230_V4_V4BROM_USBMINI 0x0300 
#define EEPROM8_SST_V4_USB               0x0400 
#define EEPROM8_SST_V4_USBMINI           0x0700 
#define EEPROM8_SST_V4_V4BROM_USB        0x0600 
#define EEPROM8_SST_V4_V4BROM_USBMINI    0x0800 
// 20081020 add by glen end


#pragma pack(1)

#define THREADTIMEOUT 1000
#define ALLOCQUESIZE 100


#define SMELOOPTIME 30 //milliseconds


#define VERSION_1   0x01

#define MAC_SIGNATURE_VALUE 0x0A0B0C0D
#define DSAP        0xAA
#define SSAP        0xAA
#define SNAPCONTROL 0x03
#define SNAPORGCODE 0x0

#define SNAPORGCODE_802_1H	0x00,0x00,0xF8
#define SNAPORGCODE_RFC1042	0x00,0x00,0x00
#define SNAPTYPELENGTH_IPX		0x8137
#define SNAPTYPELENGTH_AARP	0x80f3


#define POWERTABLEDEFAULT0 0x30303030
#define POWERTABLEDEFAULT1 0x2828221a
#define POWERTABLEDEFAULT2 0x2828221a

#define POWERTABLEDEFAULT3 0x30303030
#define POWERTABLEDEFAULT4 0x2828221a
#define POWERTABLEDEFAULT5 0x2828221a


//Jakio20070411: self defined error bit
#define VCMD_READ_3DSP_REG_ERROR  BIT0


#define WEP_SET_OK					   BIT16     //Jakio20070426 add here to test wep


//-------------------------------------------------------------------------
// Ethernet Frame Structure
//-------------------------------------------------------------------------
//- Ethernet 6-byte Address
typedef struct _ETH_ADDRESS_STRUC {
    UINT8       EthNodeAddress[ETHERNET_ADDRESS_LENGTH];
} ETH_ADDRESS_STRUC, *PETH_ADDRESS_STRUC;


//- Ethernet 14-byte Header
typedef struct _ETH_HEADER_STRUC {
    UINT8       Destination[ETHERNET_ADDRESS_LENGTH];
    UINT8       Source[ETHERNET_ADDRESS_LENGTH];
    UINT16      TypeLength;
} ETH_HEADER_STRUC, *PETH_HEADER_STRUC;


//- Ethernet Buffer (Including Ethernet Header) for Transmits
typedef struct _ETH_TX_BUFFER_STRUC {
    ETH_HEADER_STRUC    TxMacHeader;
    UINT8               TxBufferData[(TCB_BUFFER_SIZE - sizeof(ETH_HEADER_STRUC))];
} ETH_TX_BUFFER_STRUC, *PETH_TX_BUFFER_STRUC;

//- Ethernet Buffer (Including Ethernet Header) for Receives,
//- Must take into account encryption overhead that is still in buffer when this buffer is used.
typedef struct _ETH_RX_BUFFER_STRUC {
    ETH_HEADER_STRUC    RxMacHeader;
    UINT8               RxBufferData[(RCB_BUFFER_SIZE + CCMP_OVERHEAD - sizeof(ETH_HEADER_STRUC))];
} ETH_RX_BUFFER_STRUC, *PETH_RX_BUFFER_STRUC;


//SNAP HEADER
typedef struct _SNAP_HEADER_STRUC {
    UINT8       dsap;
    UINT8       ssap;
    UINT8       control;
    UINT8       orgcode1;
    UINT8       orgcode2;
    UINT8       orgcode3;
    UINT16      TypeLength;
} SNAP_HEADER_STRUC, *PSNAP_HEADER_STRUC;

typedef enum {	
	MACSW_IN_NONAP_STA = 0,
	MACSW_IBSS
} macswNonAPType_t;

typedef enum {
	MACSW_QOS_BEACON = 0,
	MACSW_QOS_MULTICAST,
	MACSW_QOS_CFP,
	MACSW_QOS_CP
} macswQoSTC_t;

typedef enum {
	MACSW_TX_COMPLETED = 0,
	MACSW_TX_REQ_TIMEOUT,
	MACSW_TX_ERROR
} macswTxReqCbStatus_t;

typedef enum
{
	MACSW_REORDERABLE_MULTICAST,
	MACSW_STRICTLY_ORDERED
}macswServiceClass_t; /* It is same as as service_class_t */

#if 0 // TODO: Jackie
#define MP_FRAG_ELEMENT SCATTER_GATHER_ELEMENT 
#define NIC_MAX_PHYS_BUF_COUNT 8

typedef struct _MP_FRAG_LIST {
    UINT32 NumberOfElements;
    ULONG_PTR Reserved;
    MP_FRAG_ELEMENT Elements[NIC_MAX_PHYS_BUF_COUNT];
} MP_FRAG_LIST, *PMP_FRAG_LIST;
#endif

//-------------------------------------------------------------------------
// Xfer pad
//-------------------------------------------------------------------------

typedef struct _XFER_PAD_STRUC {
    UINT8       pad[SHUTTLE_BYTE_XFER_LENGTH];            //xfer pad
} XFER_PAD_STRUC, *PXFER_PAD_STRUC;

//-------------------------------------------------------------------------
// Rcv pad
//-------------------------------------------------------------------------

typedef struct _RCV_PAD_STRUC {
    UINT8       pad[SHUTTLE_BYTE_XFER_LENGTH];            //receive pad
} RCV_PAD_STRUC, *PRCV_PAD_STRUC;

typedef struct _allocque {
   UINT32 *orgVAHndl;
   UINT32 LOWorgPAHndl;
   UINT32 HIGHorgPAHndl;
   UINT32 sizeInBytes;
   BOOLEAN  cached;
} allocque, *pallocque;


/*
*
* UNIPHY2
*
*
********************************************************/

typedef struct _WLSCSR_STRUC {
    
    UINT32      WLSControl0;                   //0x00
    UINT32      WLSNumber_of_Retry; 
    UINT32      WLSInterrupt_Enable; 
    UINT32      WLSStatus; 
    UINT32      WLSStatus_Clear;               //0x10
    UINT32      WLS_ChipID;                    //0x14
    UINT32      Reserved2;
    UINT32      Reserved3;
    UINT32      WLSDMA0_src_addr;              //0x20
    UINT32      WLSDMA0_dst_addr;
    UINT32      WLSDMA0_control;
    UINT32      WLSPCI_system_shuttle_port_address;
    UINT32      WLSDMA1_Host_base_addr;        //0x30
    UINT32      WLSDMA1_Abort_Word_addr;
    UINT32      Reserved4;
    UINT32      Reserved5;
    UINT32      FUNCTION_event_clr;            //0x40
    UINT32      FUNCTION_event_mask;
    UINT32      FUNCTION_present_state;
    UINT32      FUNCTION_force_event;
    UINT32      WLS_MAC_HOST_DMA0_addr8;       //0x50
    UINT32      WLS_MAC_HOST_DMA0_size8;
    UINT32      WLS_MAC_HOST_DMA0_addr7;
    UINT32      WLS_MAC_HOST_DMA0_size7;
    UINT32      WLS_MAC_HOST_DMA0_addr6;       //0x60
    UINT32      WLS_MAC_HOST_DMA0_size6;
    UINT32      WLS_MAC_HOST_DMA0_addr5;
    UINT32      WLS_MAC_HOST_DMA0_size5;    
    UINT32      WLS_MAC_HOST_DMA0_addr4;       //0x70
    UINT32      WLS_MAC_HOST_DMA0_size4;
    UINT32      WLS_MAC_HOST_DMA0_addr3;
    UINT32      WLS_MAC_HOST_DMA0_size3;
    UINT32      WLS_MAC_HOST_DMA0_addr2;       //0x80
    UINT32      WLS_MAC_HOST_DMA0_size2;
    UINT32      WLS_MAC_HOST_DMA0_addr1;
    UINT32      WLS_MAC_HOST_DMA0_size1;
    UINT32      WLS_MAC_HOST_DMA0_addr0;       //0x90
    UINT32      WLS_MAC_HOST_DMA0_size0;
    UINT32      WLS_MAC_HOST_DMA0_control;  
    UINT32      WLS_MAC_HOST_DMA1_addr2;
    UINT32      WLS_MAC_HOST_DMA1_size2;       //0xA0
    UINT32      WLS_MAC_HOST_DMA1_addr1;
    UINT32      WLS_MAC_HOST_DMA1_size1;
    UINT32      WLS_MAC_HOST_DMA1_addr0;
    UINT32      WLS_MAC_HOST_DMA1_size0;       //0xB0 
    UINT32      WLS_MAC_HOST_DMA1_control;
    UINT32      WLS_MAC_HOST_DMA0_reenable;
    UINT32      WLS_MAC_HOST_DMA1_reenable;

} WLSCSR_STRUC;

typedef struct _MAC_STRUC1 {
    UINT32      WLSsignature;
    UINT32      WLSversion;
    UINT32      WLSmacAddrLo;
    UINT32      WLSmacAddrHi;
    UINT32      WLSbssIDLo;
    UINT32      WLSbssIDHi;
    UINT32      WLSstateControl;
    UINT32      WLScontrol;
    UINT32      WLSprobeTimer;
    UINT32      WLSbeaconInterval;
    UINT32      WLStxBcnLength;
    UINT32      WLSscanChTimer_atim;
    UINT32      WLSrtsThreshRtLim;
    UINT32      WLSintEventSet;
    UINT32      WLSintEventClear;
    UINT32      WLSintMask;
    UINT32      WLSstatus;
    UINT32      WLStsfLo;
    UINT32      WLStsfHi;
    UINT32      WLScfp;
    UINT32      WLStxFIFOSize;
    UINT32      WLSfifoWatermark;
    UINT32      WLSfifoSel;
    UINT32      WLSfifoStatus;
    UINT32      WLStimingsReg1;
