#ifndef __DSP_WLAN_H
#define __DSP_WLAN_H

#include "tdsp_basetypes.h"
#include "precomp.h"
/*******************************************************************************
* Copyright(C) 2006 3DSP Corporation. All Rights Reserved.
*
* FILENAME:		DSP_wlan.h	CURRENT VERSION: 1.00.00
* PURPOSE:		Define common macro, structure and functions related to wlan.
* AUTHORS:		
* NOTES:		this file is common file for different modules.
* DECLARATION:  This document contains confidential proprietary information that
*               is solely for authorized personnel. It is not to be disclosed to
*               any unauthorized person without prior written consent of 3DSP
*               Corporation.
********************************************************************************/

/*--variables---------------------------------------------------------*/
/*--macros------------------------------------------------------------*/
#define  NUMMAPREGS       (32)   /* Number of map registers */
#define  MAXPHYMAPPINGS		(1536)	/* Max physical mappings */


/* Max group address count */
#define MAXGROUPADDRESS    (8)   /* Count of group address */

#define MAXHOSTGROUPADDRESS  (4)   /* Count of group address */

// #define TIMERDELAY          (200) /* delay 200ms to detect cp, cfp and atim descriptor */

#define TIMERSAFEINTRST     (20) /* 20ms for safe internal reset */

/* Number packets */
// #define NUM_OF_PACKETS     (32)
#ifdef DSP_WIN98
#define NUM_OF_PACKETS     (16)
#else

    (DOT11_FRM_SUBTYPE(frm_ctrl) == DOT11_FRM_SUBTYPE_BEACON))

#define DOT11_FRM_IS_ASSOC_REQ(frm_ctrl) \
    (DOT11_FRM_TYPE_IS_MGMT(frm_ctrl) &&  \
    (DOT11_FRM_SUBTYPE(frm_ctrl) == DOT11_FRM_SUBTYPE_ASSOC_REQ))

#define DOT11_FRM_IS_REASSOC_REQ(frm_ctrl) \
    (DOT11_FRM_TYPE_IS_MGMT(frm_ctrl) &&  \
    (DOT11_FRM_SUBTYPE(frm_ctrl) == DOT11_FRM_SUBTYPE_REASSOC_REQ))

#define DOT11_FRM_IS_ASSOC_RESP(frm_ctrl) \
    (DOT11_FRM_TYPE_IS_MGMT(frm_ctrl) &&  \
    (DOT11_FRM_SUBTYPE(frm_ctrl) == DOT11_FRM_SUBTYPE_ASSOC_RESP))

#define DOT11_FRM_IS_REASSOC_RESP(frm_ctrl) \
    (DOT11_FRM_TYPE_IS_MGMT(frm_ctrl) &&  \
    (DOT11_FRM_SUBTYPE(frm_ctrl) == DOT11_FRM_SUBTYPE_REASSOC_RESP))

#define DOT11_FRM_IS_DISASSOC(frm_ctrl) \
    (DOT11_FRM_TYPE_IS_MGMT(frm_ctrl) &&  \
    (DOT11_FRM_SUBTYPE(frm_ctrl) == DOT11_FRM_SUBTYPE_DISASSOC))



#define DOT11_FRM_TYPE_IS_DATA(frm_ctrl) \
    (DOT11_FRM_TYPE(frm_ctrl) == DOT11_FRM_TYPE_DATA) 

#define DOT11_FRM_TYPE_IS_CTRL(frm_ctrl) \
    (DOT11_FRM_TYPE(frm_ctrl) == DOT11_FRM_TYPE_CTRL) 

#define DOT11_FRM_IS_DATA(frm_ctrl) \
    ((DOT11_FRM_TYPE(frm_ctrl) == DOT11_FRM_TYPE_DATA) &&   \
     (DOT11_FRM_SUBTYPE(frm_ctrl) == DOT11_FRM_SUBTYPE_DATA))

// NULL_FUNC frame is null data frame
#define DOT11_FRM_IS_NULL_FUNC(frm_ctrl) \
	((DOT11_FRM_TYPE(frm_ctrl) == DOT11_FRM_TYPE_DATA) && \
	(DOT11_FRM_SUBTYPE(frm_ctrl) == DOT11_FRM_SUBTYPE_NULL_FUNC))

#define DOT11_FRM_TO_DS(frm_ctrl) \
    ((frm_ctrl & DOT11_FRM_CTRL_BIT_TO_DS) != 0)

#define DOT11_FRM_FROM_DS(frm_ctrl) \
    ((frm_ctrl & DOT11_FRM_CTRL_BIT_FROM_DS) != 0)

#define DOT11_FRM_MORE_FRAG(frm_ctrl) \
    ((frm_ctrl & DOT11_FRM_CTRL_BIT_MORE_FRAG) != 0)

#define DOT11_FRM_RETRY(frm_ctrl) \
    ((frm_ctrl & DOT11_FRM_CTRL_BIT_RETRY) != 0)

#define DOT11_FRM_PWR_MGMT(frm_ctrl) \
    ((frm_ctrl & DOT11_FRM_CTRL_BIT_PWR_MGMT) != 0)

#define DOT11_FRM_MORE_DATA(frm_ctrl) \
    ((frm_ctrl & DOT11_FRM_CTRL_BIT_MORE_DATA) != 0)

#define DOT11_FRM_PRIVACY(frm_ctrl) \
    ((frm_ctrl & DOT11_FRM_CTRL_BIT_PRIVACY) != 0)

#define DOT11_FRM_ORDER(frm_ctrl) \
    ((frm_ctrl & DOT11_FRM_CTRL_BIT_ORDER) != 0)


#ifdef ANTENNA_DIVERSITY
#define DSP_CARD_IS_MINICARD(id) \
    ((id & BIT8) == 0)
#endif
//
#define SSID_LENGTH_VALID(len) \
	((len > 0) && (len <= WLAN_SSID_MAXLEN))

#define SUPPORT_RATE_LENGTH_VALID(len) \
	((len > 0) && (len <= WLAN_MAX_RATE_SUPPORT_LEN))

#define IS_MATCH_IN_ESSMODE(macmode,cap) \
	((macmode == WLAN_MACMODE_ESS_STA && CAP_EXPRESS_BSS(cap)) || \
 	  (macmode == WLAN_MACMODE_IBSS_STA && CAP_EXPRESS_IBSS(cap)))

#define IS_MATCH_IN_SSID(ele1,len1,data1,ele2,len2,data2) \
	((ele1 == ele2) &&	\
	 (len1 == len2)  &&		\
	 (0 == sc_memory_cmp(data1,data2,len1)))
	 
#define IS_MATCH_IN_ADDRESS(dst,src) \
	(0 == sc_memory_cmp(dst,src,ETH_LENGTH_OF_ADDRESS))

#define WLAN_COPY_ADDRESS(dst,src) \
	(sc_memory_copy(dst,src,ETH_LENGTH_OF_ADDRESS))
#define GetRssi(r)  (r & 0x7f)
#define GetRssiMsb(r)  (r & 0x80)
/*hardware  frame struct*/
//#pragma pack(1)

// fdeng mask this !
//
//#pragma pack(push,1)


typedef struct USBWLAN_HW_FRMHDR_TX {
    UINT32 len_speed_ctrl;
    UINT32 frmctrl_fragdur;
    UINT32 addr1lo_txdurid;
    UINT32 addr1hi;
    UINT32 addr3lo;
    UINT32 seqctrl_addr3hi;
} USBWLAN_HW_FRMHDR_TX, *PUSBWLAN_HW_FRMHDR_TX;
typedef struct _wpakey_info_tag
{
	BOOLEAN						in_use;    //ind the key has mapped into hw
	BOOLEAN						WEP_on;  //ind the key value is valid
	UINT8						mac_address[WLAN_ADDR_LEN];
	UINT8						key[MAX_WEP_KEY_BUFFER_LEN];
	UINT8						key_len_in_bytes;
	UINT8 					    keyid;
	UINT32                      cyper;   //no use here, get the featuren by encryption mode
	BOOLEAN                     multicast; //
	UINT32                     	index;
}wpakey_info_t;

typedef struct _KEY_CNTL_ADDR
{
	UINT32         hi_mac_addr:16;
	UINT32 	     keyvalid:1;
	UINT32         ciphertype:2;
	UINT32         keyid:2;
	UINT32 	     keyindex:9;
	UINT32 	     xcastKey:1;
	UINT32 	     entryNotDone:1;
} KEY_CNTL_ADDR_T, *PKEY_CNTL_ADDR_T;


//Jakio20070426: mac_addr should be 4bytes array, the highest 16bits are stored in key_cntl register
typedef struct _KEY_MLME_REG
{
	UINT32           key0_31;                      //90
	UINT32           key32_63;                    //94
	UINT32           key64_95;                    //98
	UINT32           key96_127;                 //9c
	UINT8		mac_addr[WLAN_ETHADDR_LEN - 2];      //a0
	//UINT8		mac_addr[WLAN_ETHADDR_LEN];      //a0
	KEY_CNTL_ADDR_T   key_cntl;		//a4
	UINT32           key_size_cntl;		//a8
} KEY_MLME_REG_T, *PKEY_MLME_REG_T;
typedef struct _RESET_TYPE
{
	UINT8           type;
	UINT32           sub_type;
} RESET_TYPE_T, *P_RESET_TYPE_T;

typedef struct _BRS11GOFDM_REG
{
	UINT32         ofdm_rate:8;
	UINT32 	     ofdm_rts_rate:4;
	UINT32         dsss_rts_rate:2;
	UINT32         ctstoself:1;
	UINT32 	     reserved:17;
} BRS11GOFDM_REG_T, *PBRS11GOFDM_REG_T;

typedef struct _BBREG2023_REG
{
	UINT32         bbreg20:8;
	UINT32 	     bbreg21:8;
	UINT32         bbreg22:8;
	UINT32         bbreg23_left:5;
	UINT32         soft_doze:1;
	UINT32         ap_associated:1;
	UINT32         auto_corr:1;
} BBREG2023_REG_T, *PBBREG2023_REG_T;

#if 1		// fdeng@20100422,	It seemed that no one use this !!!

//fdeng
#pragma pack(push,1)


//Struct of SP20 code file in the static buffer
typedef struct _SP20_BIN_CODE {
	UINT32 Size;		// Size of the bin resource file
	UINT32 Port;		// SP20 mem port index
	UINT8   Code[1];	// SP20 code - copied from bin resource
} SP20_BIN_CODE, *PSP20_BIN_CODE;

// 090702 glen added for extend card type support
typedef struct {
	UINT32 m_Mark;	// mark
	UINT32 Size;		// Size of support cardtypes
	UINT32 m_dwID[1];	// cardID
} SP20_SUPPORT_CODETABLE, *PSP20_SUPPORT_CODETABLE;

typedef struct  
{
	UINT32 m_dwID;		// cardID = CodeId+cardID 
	UINT32 m_dwOffset;	// code offset
	UINT32 m_dwLen;		// code Len
	UINT32 m_dwPortBase;		// code portbase
} SP20_BIN_CODE_TABLE,*PSP20_BIN_CODE_TABLE ;

// 090702 glen added for extend card type support end
typedef struct _SP20_FILE_HEAD
{
	UINT8          file_name[4];			// 00h - 03h	File Type Mark, Must be string "SP20"
	UINT32 	     bin_len;				// 04h - 07h	Bin File Data Length, not include this FileHead
	UINT32         file_timestamp;  	  	// 08h - 0Bh	File timestamp
	UINT32         bin_checksum;		// 0Ch - 0Fh	Bin Data checksum
	UINT32         reserve1[4];			// 10h - 1Fh	Reserve space
	UINT32         wlanonly_offset;  		// 20h - 23h	WLAN only DSP code data offset address
	UINT32         wlanonly_len;			// 24h - 27h	WLAN only DSP code data Length
	UINT32         btonly_offset;  		// 28h - 2Bh	BT only DSP code data offset address
	UINT32         btonly_len;			// 2Ch - 2Fh	BT only DSP code data Length
	UINT32         combo_offset;  		// 30h -33h	COMBO DSP code data offset address
	UINT32         combo_len;			// 34h -37h	COMBO DSP code data Length
	UINT32         eeprom_offset;  		// 38h - 3Bh	EEPROM access DSP code data offset address
	UINT32         eeprom_len;			// 3Ch - 3Fh	EEPROM access DSP code data Length
	UINT32         reserve2[4];			// 40h - 4Fh	Reserve space
	UINT32         wlan8051_offset;		// 50h - 53h	WLAN only 8051 code data offset address
	UINT32         wlan8051_len;		// 54h - 57h	WLAN only 8051 code data Length
	UINT32         bt8051_offset;  		// 58h - 5Bh	BT only DSP 8051 data offset address
	UINT32         bt8051_len;			// 5Ch - 5Fh	BT only DSP 8051 data Length
	UINT32         combo8051_offset;  	// 60h -63h	COMBO DSP 8051 data offset address
	UINT32         combo8051_len;		// 64h -67h	COMBO DSP 8051 data Length
	UINT32         reserve3[2];			// 68h - 7Fh	Reserve space
	UINT8           bin_data[1];			// 80H~	WLAN only DSP code data region
									// BT only DSP code data region
									// COMBO DSP code data region
									// EEPROM access DSP code data region
									//  WLAN only 8051 code data region 
									// BT only 8051 code data region
									// COMBO 8051 code data region
} SP20_FILE_HEAD_T, *PSP20_FILE_HEAD_T;


#pragma pack(pop)


#endif



/*--variables---------------------------------------------------------*/


/*
 * User configurable Macros
 */
// #define FIFOS							3		/* cp/cfp/prio */
 #define FIFOS							4		/* cp/cfp/prio/bcn */
 #define TUPLE_SIZE						32		/* 32/64 */
 #define HEADER_NODES					64		/* 20 */		
												/* 32/64 */
 #define DATA_NODES						HEADER_NODES		
												/* 32/64/128/256 */
 #define MSDU_LIST_SIZE					32		/* 32/64 */
 #define TX_BLOCK_SIZE					32		/* 32/64/128 */
 #define DATA_NODE_LENGTH	   			1536	    /* 256/512/1024/2048/2340 */
